# -*- coding: UTF-8 -*-
"""
@Project ：LangGraph 
@File    ：Weapons.py
@IDE     ：PyCharm 
@Author  ：Write Bug
@Date    ：2025/12/10 09:34 
"""

# 定义武器库
weapons_list = [
    {"id": "w01", "name": "生锈铁剑", "atk": 5, "hit_rate": 0.95, "desc": "新手村捡来的，破伤风之刃", "effect": None},
    {"id": "w02", "name": "精钢长剑", "atk": 20, "hit_rate": 0.85, "desc": "标准的骑士装备", "effect": None},
    {"id": "w03", "name": "🗡 皇家骑士巨剑", "atk": 25, "hit_rate": 0.90, "desc": "王国卫队的制式武器，性能均衡",
     "effect": None},
    {"id": "w04", "name": "🗡️ 双持匕首", "atk": 30, "hit_rate": 1.0, "desc": "虽然单次伤害不高，但绝对不会失手 (100%命中)",
     "effect": None},
    {"id": "w05", "name": "⌨️ 机械键盘", "atk": 40, "hit_rate": 1.0, "desc": "物理与精神双重打击，特别是青轴",
     "effect": "noise"},
    {"id": "w10", "name": "巨型战斧", "atk": 45, "hit_rate": 0.65, "desc": "伤害爆炸，但太重了容易挥空 (高风险)",
     "effect": None},
    {"id": "w11", "name": "🔥 烈焰魔剑", "atk": 50, "hit_rate": 0.85, "desc": "附带魔法火焰，专门克制魔王",
     "effect": "burn"},
    {"id": "w12", "name": "🩸 嗜血魔剑", "atk": 50, "hit_rate": 0.85, "desc": "附带吸血，魔王也是碳基生物吗？",
     "effect": "hemophagia"},
    {"id": "w13", "name": "❄ 寒冰魔剑", "atk": 50, "hit_rate": 0.85, "desc": "水坎·冰封破！",
     "effect": "congelation"},
    {"id": "w19", "name": "圣剑·Excalibur", "atk": 80, "hit_rate": 0.90, "desc": "专门为了斩杀魔王而存在的传说武器。",
     "effect": "demon_slayer_multiplier_2.5"},  # 对魔王造成2.5倍伤害
    {"id": "w99", "name": "龙之牙", "atk": 999, "hit_rate": 0.10, "desc": "威力巨大但全是Bug(很难命中)",
     "effect": None},  # 极端数值测试

]

weapons_list2 = [
    {"name": "🧙‍♂️ 枯木法杖", "atk": 15, "hit_rate": 0.90, "desc": "枯木枯木落！", "effect": "mana_restore"},
    {"name": "❄️ 寒冰射手", "atk": 35, "hit_rate": 0.95, "desc": "不是豌豆射手", "effect": "freeze"},
    {"name": "⚡ 宙斯之怒", "atk": 60, "hit_rate": 0.75, "desc": "雷属性伤害，容易误伤友军，友军之怒",
     "effect": "paralyze"},
]
