# -*- coding: UTF-8 -*-
"""
@Project ：LangGraph 
@File    ：Monsters.py
@IDE     ：PyCharm 
@Author  ：Write Bug
@Date    ：2025/12/10 10:15 
"""

# 定义怪物库
monsters_list = [
    {
        "name": "史莱姆",
        "hp": 30,
        "max_hp": 30,
        "base_atk": 5,
        "def": 0,
        "exp": 10,
        "burn_stack": 0,  # 被火焰层数
        "loot": [
            {"item": "精钢长剑", "chance": 0.3},  # 30% 掉落铁剑
            {"item": "🍎 小苹果", "chance": 0.5},  # 50% 掉落苹果
        ]
    },
    {
        "name": "哥布林斥候",
        "hp": 60,
        "max_hp": 60,
        "base_atk": 12,
        "def": 2,
        "exp": 25,
        "burn_stack": 0,  # 被火焰层数
        "loot": [
            {"item": "🗡️ 双持匕首", "chance": 0.05},  # 稀有掉落
            {"item": "锁子甲", "chance": 0.3},

        ]
    },
    {
        "name": "青牙巨魔",
        "hp": 100,
        "max_hp": 100,
        "base_atk": 12,
        "def": 5,
        "exp": 35,
        "burn_stack": 0,  # 被火焰层数
        "loot": [
            {"item": "巨型战斧", "chance": 0.3},
            {"item": "💪 力量药剂", "chance": 0.5},
            {"item": "🍗 烤鸡腿", "chance": 0.7},
        ]
    },
    {
        "name": "发狂的程序员",
        "hp": 100,
        "max_hp": 100,
        "base_atk": 20,
        "def": 10,
        "exp": 50,
        "burn_stack": 0,  # 被火焰层数
        "loot": [
            {"item": "⌨️ 机械键盘", "chance": 0.01},  # 极品掉落 1%
            {"item": "cos服", "chance": 0.2},
            {"item": "☕ 浓缩咖啡", "chance": 0.8},  # 必掉续命水
        ]
    },
    {
        "name": "宝箱怪",
        "hp": 150,
        "max_hp": 150,
        "base_atk": 35,
        "def": 20,
        "exp": 80,
        "burn_stack": 0,  # 被火焰层数
        "loot": [
            {"item": "🩸 嗜血魔剑", "chance": 0.1},  # 欧皇时刻
            {"item": "🔥 烈焰魔剑", "chance": 0.3},  # 欧皇时刻
            {"item": "🗡 皇家骑士巨剑", "chance": 0.7},
            {"item": "🛡️ 皇家骑士板甲", "chance": 0.7},
        ]
    }
]